; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v4 ?v5)
             (pred_5 ?v8 ?v1)
             (pred_1 ?v4 ?v1)
             (pred_7 ?v7 ?v4 )
	     (pred_4 ?v4)
             (pred_3 ?v10)
             (pred_11 ?v8)
             (pred_10 ?v1)
             (pred_2 ?v4)
             (pred_8 ?v8)
             (pred_9 ?v4)
             (pred_6 ))



(:action op_3
:parameters (?v13 ?v11 ?v12 ?v3)
:precondition (and (pred_3 ?v13) (pred_3 ?v11) (pred_11 ?v12) (pred_10 ?v3)
          (pred_12 ?v13 ?v11) (pred_5 ?v12 ?v3)
                   (pred_1 ?v11 ?v3) (pred_4 ?v13) 
                   (pred_2 ?v11) (pred_8 ?v12))
:effect (and  (pred_9 ?v11) (not (pred_2 ?v11))))


(:action op_1
:parameters (?v13 ?v6)
:precondition (and (pred_3 ?v13) (pred_3 ?v6)
               (pred_4 ?v13) (pred_12 ?v13 ?v6) (pred_9 ?v6))
:effect (and (pred_4 ?v6) (not (pred_4 ?v13))))

(:action op_4
:parameters (?v13 ?v12)
:precondition (and (pred_3 ?v13) (pred_11 ?v12) 
                  (pred_4 ?v13) (pred_7 ?v12 ?v13) (pred_6 ))
:effect (and (pred_8 ?v12)
   (not (pred_7 ?v12 ?v13)) (not (pred_6 ))))


(:action op_2
:parameters (?v13 ?v9 ?v2)
:precondition (and (pred_3 ?v13) (pred_11 ?v9) (pred_11 ?v2)
                  (pred_4 ?v13) (pred_8 ?v2) (pred_7 ?v9 ?v13))
:effect (and (pred_8 ?v9) (pred_7 ?v2 ?v13)
        (not (pred_8 ?v2)) (not (pred_7 ?v9 ?v13))))

(:action op_5
:parameters (?v13 ?v12)
:precondition (and (pred_3 ?v13) (pred_11 ?v12) 
                  (pred_4 ?v13) (pred_8 ?v12))
:effect (and (pred_6 ) (pred_7 ?v12 ?v13) (not (pred_8 ?v12)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_11 obj_08 obj_18 obj_27 obj_09 obj_30 obj_05 obj_03 obj_22 obj_10 obj_15 obj_23 obj_29 obj_21 obj_28 obj_04 obj_13 obj_26 obj_24 obj_06 obj_07 obj_02 obj_01 obj_12
    obj_14 obj_17
    obj_20 obj_16 obj_25
    )

    (:init
       (pred_6)

       (pred_3 obj_19)
       (pred_3 obj_11)
       (pred_3 obj_08)
       (pred_3 obj_18)
       (pred_3 obj_27)
       (pred_3 obj_09)
       (pred_3 obj_30)
       (pred_3 obj_05)
       (pred_3 obj_03)
       (pred_3 obj_22)
       (pred_3 obj_10)
       (pred_3 obj_15)
       (pred_3 obj_23)
       (pred_3 obj_29)
       (pred_3 obj_21)
       (pred_3 obj_28)
       (pred_3 obj_04)
       (pred_3 obj_13)
       (pred_3 obj_26)
       (pred_3 obj_24)
       (pred_3 obj_06)
       (pred_3 obj_07)
       (pred_3 obj_02)
       (pred_3 obj_01)
       (pred_3 obj_12)
       (pred_10 obj_14)
       (pred_10 obj_17)
       (pred_11 obj_20)
       (pred_11 obj_16)
       (pred_11 obj_25)

       (pred_12 obj_19 obj_09)
       (pred_12 obj_19 obj_11)
       (pred_12 obj_11 obj_30)
       (pred_12 obj_11 obj_08)
       (pred_12 obj_11 obj_19)
       (pred_12 obj_08 obj_05)
       (pred_12 obj_08 obj_18)
       (pred_12 obj_08 obj_11)
       (pred_12 obj_18 obj_03)
       (pred_12 obj_18 obj_27)
       (pred_12 obj_18 obj_08)
       (pred_12 obj_27 obj_22)
       (pred_12 obj_27 obj_18)
       (pred_12 obj_09 obj_10)
       (pred_12 obj_09 obj_30)
       (pred_12 obj_09 obj_19)
       (pred_12 obj_30 obj_15)
       (pred_12 obj_30 obj_05)
       (pred_12 obj_30 obj_11)
       (pred_12 obj_30 obj_09)
       (pred_12 obj_05 obj_23)
       (pred_12 obj_05 obj_03)
       (pred_12 obj_05 obj_08)
       (pred_12 obj_05 obj_30)
       (pred_12 obj_03 obj_29)
       (pred_12 obj_03 obj_22)
       (pred_12 obj_03 obj_18)
       (pred_12 obj_03 obj_05)
       (pred_12 obj_22 obj_21)
       (pred_12 obj_22 obj_27)
       (pred_12 obj_22 obj_03)
       (pred_12 obj_10 obj_28)
       (pred_12 obj_10 obj_15)
       (pred_12 obj_10 obj_09)
       (pred_12 obj_15 obj_04)
       (pred_12 obj_15 obj_23)
       (pred_12 obj_15 obj_30)
       (pred_12 obj_15 obj_10)
       (pred_12 obj_23 obj_13)
       (pred_12 obj_23 obj_29)
       (pred_12 obj_23 obj_05)
       (pred_12 obj_23 obj_15)
       (pred_12 obj_29 obj_26)
       (pred_12 obj_29 obj_21)
       (pred_12 obj_29 obj_03)
       (pred_12 obj_29 obj_23)
       (pred_12 obj_21 obj_24)
       (pred_12 obj_21 obj_22)
       (pred_12 obj_21 obj_29)
       (pred_12 obj_28 obj_06)
       (pred_12 obj_28 obj_04)
       (pred_12 obj_28 obj_10)
       (pred_12 obj_04 obj_07)
       (pred_12 obj_04 obj_13)
       (pred_12 obj_04 obj_15)
       (pred_12 obj_04 obj_28)
       (pred_12 obj_13 obj_02)
       (pred_12 obj_13 obj_26)
       (pred_12 obj_13 obj_23)
       (pred_12 obj_13 obj_04)
       (pred_12 obj_26 obj_01)
       (pred_12 obj_26 obj_24)
       (pred_12 obj_26 obj_29)
       (pred_12 obj_26 obj_13)
       (pred_12 obj_24 obj_12)
       (pred_12 obj_24 obj_21)
       (pred_12 obj_24 obj_26)
       (pred_12 obj_06 obj_07)
       (pred_12 obj_06 obj_28)
       (pred_12 obj_07 obj_02)
       (pred_12 obj_07 obj_04)
       (pred_12 obj_07 obj_06)
       (pred_12 obj_02 obj_01)
       (pred_12 obj_02 obj_13)
       (pred_12 obj_02 obj_07)
       (pred_12 obj_01 obj_12)
       (pred_12 obj_01 obj_26)
       (pred_12 obj_01 obj_02)
       (pred_12 obj_12 obj_24)
       (pred_12 obj_12 obj_01)
       (pred_2 obj_26)
       (pred_2 obj_28)
       (pred_2 obj_01)
       (pred_1  obj_26 obj_14)
       (pred_1  obj_28 obj_17)
       (pred_1  obj_01 obj_14)
       (pred_9 obj_19)
       (pred_9 obj_11)
       (pred_9 obj_08)
       (pred_9 obj_18)
       (pred_9 obj_27)
       (pred_9 obj_09)
       (pred_9 obj_30)
       (pred_9 obj_05)
       (pred_9 obj_03)
       (pred_9 obj_22)
       (pred_9 obj_10)
       (pred_9 obj_15)
       (pred_9 obj_23)
       (pred_9 obj_29)
       (pred_9 obj_21)
       (pred_9 obj_04)
       (pred_9 obj_13)
       (pred_9 obj_24)
       (pred_9 obj_06)
       (pred_9 obj_07)
       (pred_9 obj_02)
       (pred_9 obj_12)

       (pred_5  obj_20 obj_14)
       (pred_5  obj_16 obj_17)
       (pred_5  obj_25 obj_14)
       (pred_7 obj_20 obj_08)
       (pred_7 obj_16 obj_04)
       (pred_7 obj_25 obj_24)
       (pred_4 obj_27)
    )

    (:goal (and
       (pred_7 obj_20 obj_18)
       (pred_7 obj_25 obj_03)
    ))
(:constraints
  (always (not (pred_4 obj_22)))
)
)

; plan
1. (op_1 obj_27 obj_18)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_18)
   goals met: 0 of 2
2. (op_1 obj_18 obj_08)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_08)
   goals met: 0 of 2
3. (op_4 obj_08 obj_20)
   deleted: (pred_7 obj_20 obj_08) (pred_6)
   added: (pred_8 obj_20)
   goals met: 0 of 2
4. (op_1 obj_08 obj_18)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_18)
   goals met: 0 of 2
5. (op_5 obj_18 obj_20)
   deleted: (pred_8 obj_20)
   added: (pred_6) (pred_7 obj_20 obj_18)
   goals met: 1 of 2
6. (op_1 obj_18 obj_03)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_03)
   goals met: 1 of 2
7. (op_1 obj_03 obj_29)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_29)
   goals met: 1 of 2
8. (op_1 obj_29 obj_21)
   deleted: (pred_4 obj_29)
   added: (pred_4 obj_21)
   goals met: 1 of 2
9. (op_1 obj_21 obj_24)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_24)
   goals met: 1 of 2
10. (op_4 obj_24 obj_25)
   deleted: (pred_7 obj_25 obj_24) (pred_6)
   added: (pred_8 obj_25)
   goals met: 1 of 2
11. (op_1 obj_24 obj_21)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_21)
   goals met: 1 of 2
12. (op_1 obj_21 obj_29)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_29)
   goals met: 1 of 2
13. (op_1 obj_29 obj_03)
   deleted: (pred_4 obj_29)
   added: (pred_4 obj_03)
   goals met: 1 of 2
14. (op_5 obj_03 obj_25)
   deleted: (pred_8 obj_25)
   added: (pred_6) (pred_7 obj_25 obj_03)
   goals met: 2 of 2
